# EXL_DeleteSheet

## Description
Delete the sheet with the specified name.

```pascal
FUNCTION EXL_DeleteSheet(sheetName : STRING) : BOOLEAN;
```

```python

def vs.EXL_DeleteSheet(sheetName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|sheetName|STRING||

## Version
Availability: from Vectorworks 2021
## Category
* Excel